---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonAlpha
source: html/7892bf0f-b0dc-d84a-7356-17ae18d2a2d6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonAlpha Property

"Principal Axes Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonAlpha { get; }
```